In [3]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [4]:
import pandas
import configparser
import psycopg2

In [5]:
config = configparser.ConfigParser()
config.read('config.ini')

host = config['myaws']['host']
user = config['myaws']['user']
pswd = config['myaws']['pswd']
database = config['myaws']['database']

In [6]:
conn = psycopg2.connect(
                        host = host,
                        user = user,
                        password = pswd,
                        dbname = database
)

In [7]:
cur= conn.cursor()

In [36]:
sql_statement = '''
                select
                teacher_gp8.name as tname,
                count(course_gp8.name) as course_num
                from teacher_gp8
                inner join course_gp8
                on teacher_gp8.email = course_gp8.temail
                group by teacher_gp8.name
                '''

In [37]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

                                               tname  course_num
0  Noel Hendrickson                              ...           2
1  Kathleen Moore                                ...           1
2  Stephen Marrin                                ...           1
3  New Professor                                 ...           2

## Q5

In [38]:
sql_insert_statement = '''
                        insert into teacher_gp8(email, name, office)
                        values('{}', '{}', '{}')
                        '''.format('new_email1', 'new_name1', 'new_office1')
print(sql_insert_statement)

                        insert into teacher_gp8(email, name, office)
                        values('new_email1', 'new_name1', 'new_office1')

In [39]:
cur.execute(sql_insert_statement)

In [40]:
conn.commit()

In [62]:
df = pandas.read_sql_query('''select * from teacher_gp8''',conn)
df[:]

,email,name,office
0,hendrinx@jmu.edu ...,Noel Hendrickson ...,ISAT 317
1,marrinsp@jmu.edu ...,Stephen Marrin ...,EnGeo 2104
2,moore8ka@jmu.edu ...,Kathleen Moore ...,ISAT 116
3,teateaa@jmu.edu ...,Anthony Teate ...,ISAT 126
4,newprofessor@jmu.edu ...,New Professor ...,ISAT 000
5,taoqx@jmu.edu ...,Qingjiu (Tom) Tao ...,EnGeo 2107
6,new_email1 ...,new_name1 ...,new_office1

In [64]:
sql_insert_statement = '''
                        insert into course_gp8(name, room, temail)
                        values('{}', '{}', '{}')
                        '''.format('Intelligence Analysis 102', 'EnGeo 001', 'new_email1')
print(sql_insert_statement)

                        insert into course_gp8(name, room, temail)
                        values('Intelligence Analysis 102', 'EnGeo 001', 'new_email1')

In [65]:
cur.execute(sql_insert_statement)

In [66]:
conn.commit()

In [67]:
df = pandas.read_sql_query('''select * from course_gp8''',conn)
df[:]

,name,room,temail
0,Seminar on Issues in Intelligence Analysis ...,EnGeo 1204,marrinsp@jmu.edu ...
1,Counterfactual Reasoning ...,EnGeo 2202,hendrinx@jmu.edu ...
2,Introduction to Intelligence Analysis ...,EnGeo 2301,hendrinx@jmu.edu ...
3,Technology Applications in a Networked World ...,EnGeo 2202,moore8ka@jmu.edu ...
4,Intelligence Analysis 101 ...,EnGeo 000,newprofessor@jmu.edu ...
5,Intelligence Analysis 102 ...,EnGeo 001,new_email1 ...
6,Selected Topics in Intelligence Analysis ...,EnGeo 2014,newprofessor@jmu.edu ...

## Q6

In [68]:
sql_insert_statement = '''
                        update course_gp8
                        set temail = 'newprofessor@jmu.edu'
                        where temail = 'taoqx@jmu.edu'
                        '''
print(sql_insert_statement)

                        update course_gp8
                        set temail = 'newprofessor@jmu.edu'
                        where temail = 'taoqx@jmu.edu'

In [69]:
cur.execute(sql_insert_statement)

In [70]:
conn.commit()

In [71]:
df = pandas.read_sql_query('''select * from course_gp8''',conn)
df[:]

,name,room,temail
0,Seminar on Issues in Intelligence Analysis ...,EnGeo 1204,marrinsp@jmu.edu ...
1,Counterfactual Reasoning ...,EnGeo 2202,hendrinx@jmu.edu ...
2,Introduction to Intelligence Analysis ...,EnGeo 2301,hendrinx@jmu.edu ...
3,Technology Applications in a Networked World ...,EnGeo 2202,moore8ka@jmu.edu ...
4,Intelligence Analysis 101 ...,EnGeo 000,newprofessor@jmu.edu ...
5,Intelligence Analysis 102 ...,EnGeo 001,new_email1 ...
6,Selected Topics in Intelligence Analysis ...,EnGeo 2014,newprofessor@jmu.edu ...

In [81]:
sql_insert_statement = '''
                        delete from teacher_gp8
                        where email = 'taoqx@jmu.edu'
                        '''
print(sql_insert_statement)

                        delete from teacher_gp8
                        where email = 'taoqx@jmu.edu'

In [82]:
cur.execute(sql_insert_statement)

In [83]:
conn.commit()

In [84]:
df = pandas.read_sql_query('''select * from teacher_gp8''',conn)
df[:]

,email,name,office
0,hendrinx@jmu.edu ...,Noel Hendrickson ...,ISAT 317
1,marrinsp@jmu.edu ...,Stephen Marrin ...,EnGeo 2104
2,moore8ka@jmu.edu ...,Kathleen Moore ...,ISAT 116
3,teateaa@jmu.edu ...,Anthony Teate ...,ISAT 126
4,newprofessor@jmu.edu ...,New Professor ...,ISAT 000
5,new_email1 ...,new_name1 ...,new_office1